app/controllers/clearance_batches_controller.rb

SELECT "clearance_batches".* FROM "clearance_batches"
---
  def index
     @clearance_batches  = ClearanceBatch.all

INSERT INTO "clearance_batches" ("warehouse_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["warehouse_id", 1], ["created_at", "2017-06-08 21:01:41.593116"], ["updated_at", "2017-06-08 21:01:41.593116"]]
SELECT COUNT(*) FROM "items" WHERE "items"."clearance_batch_id" = ?  [["clearance_batch_id", 1]]
SELECT  "clearance_batches".* FROM "clearance_batches" WHERE "clearance_batches"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 300]]
---
  def create
    clearance_batch = ClearanceBatch.create
    potential_item_ids = process_file(params[:csv_batch_file].tempfile)
    clearance_batch.clearance_items!(potential_item_ids)
    alert_messages = []
    if clearance_batch.item_errors && clearance_batch.item_errors.any?
      alert_messages << "#{clearance_batch.item_errors.count} item id(s) raised errors and were not clearanced"
      clearance_batch.item_errors.each {|error| alert_messages << error }
      flash[:alert] = alert_messages.join("<br/>") if alert_messages.any?
    end
    clearance_batch.reload
    flash[:notice]  = "#{clearance_batch.items.count} item(s) clearanced in batch #{clearance_batch.id}"

SELECT  "clearance_batches".* FROM "clearance_batches" WHERE "clearance_batches"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "styles".* FROM "styles" WHERE "styles"."id" = ? LIMIT 1  [["id", 3]]
SELECT "items".* FROM "items" WHERE "items"."clearance_batch_id" = ?  [["clearance_batch_id", 1]]
---
  def show
    @batch = ClearanceBatch.find(params[:id])
    @items = @batch.items.includes(:style)