app/controllers/clearance_batches_controller.rb

  def create
    potential_item_ids = process_file(params[:csv_batch_file].tempfile)
    service = ClearancingService.new
    service.process_items(potential_item_ids)
    alert_messages = []
    if service.clearancing_status.errors.any?
---
SELECT "items".* FROM "items" WHERE "items"."status" = ? AND "items"."id" = ?  [["status", "sellable"], ["id", 300]]